protected/humhub/modules/space/models/Membership.php

    public function countNewItems()
    {
        $query = Content::find();
        $query->where(['stream_channel' => 'default']);
        $query->andWhere(['contentcontainer_id' => $this->space->contentContainerRecord->id]);
        $query->andWhere(['>', 'created_at', $this->last_visit]);

        return $query->count();
---
SELECT COUNT(*) FROM `content` WHERE (`stream_channel`='default') AND (`contentcontainer_id`=45) AND (`created_at` > '2019-12-13 01:54:10')