protected/modules/calendar/models/CalendarEntry.php

    public function setType($type)
    {
        $type = ($type instanceof ContentTag) ? $type : ContentTag::findOne($type);
---
SELECT * FROM `content_tag` WHERE (`content_tag`.`module_id`='calendar') AND (`content_tag`.`module_id`='calendar') AND (`content_tag`.`module_id`='calendar') AND (0=1)

    public function findParticipant(User $user = null)
    {
        if (!$user) {
            $user = Yii::$app->user->getIdentity();
        }

        if(!$user) {
            return;
        }

        return CalendarEntryParticipant::findOne(['user_id' => $user->id, 'calendar_entry_id' => $this->id]);
---
SELECT * FROM `calendar_entry_participant` WHERE (`user_id`=13) AND (`calendar_entry_id`=29)

    public function getParticipationState(User $user = null)
    {
        if (Yii::$app->user->isGuest) {
            return 0;
        }


        if ($user == null) {
            $user = Yii::$app->user->getIdentity();
        }

        $participant = CalendarEntryParticipant::findOne(['user_id' => $user->id, 'calendar_entry_id' => $this->id]);
---
SELECT * FROM `calendar_entry_participant` WHERE (`user_id`=13) AND (`calendar_entry_id`=54)