protected/humhub/modules/dashboard/controllers/DashboardController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest) {
            return $this->render('index_guest', []);
        } else {
            return $this->render('index', [
                'showProfilePostForm' => Yii::$app->getModule('dashboard')->settings->get('showProfilePostForm'),
                'contentContainer' => Yii::$app->user->getIdentity(),
                'commuityAll' => \humhub\modules\space\models\Space::find()->where(['community' => '_0_'])->all()
---
SELECT * FROM `space` WHERE `community`='_0_'