protected/modules/linkpreview/widgets/Viewer.php

SELECT * FROM `linkpreview` WHERE (`class`='humhub\\modules\\post\\models\\Post') AND (`pk`=44)
---
    public function run()
    {
        if(!$this->record) {
            return;
        }

        $this->linkPreview = LinkPreview::findOne(['class' => $this->record->className(), 'pk' => $this->record->getPrimaryKey()]);